export function getPhotos(q, page) {
  const BASE_URL = 'https://pixabay.com/api/'; // Ендпоінт - посилання на сервер
  const API_KEY = '45170057-222a781b727842b81c5ded16b'; // ключ доступу до серверу (може бути, а може не бути)
  const params = new URLSearchParams({
    key: API_KEY,
    page, // передається номер сторінки, яку треба показувати в моменті прям зараз в конкретну секунду, а потім їх можна довантажувати
    per_page: 10, // кількість елементів за одним запитом (тобто коли людина перший раз ввела слово), наступним запитом буде вважатись натискання на кнопку показати більше і довантажить таку ж кількість)
    q, // запит, який вводять в пошук
    image_type: 'photo',
    orientation: 'horizontal',
    safesearch: 'true',
  });
  // Функція, яка робить запит на сервер. Повертає проміс (обіцянку повернути відповіль). Може бути помилка, а може бути успіх. Успіх я оброблюю в then, а помилку в catch.
  return fetch(`${BASE_URL}?${params}`).then(response => {
    // в then я маю отримати response - це успішна відповідь, яка приходить з серверу в форматі JSON (умовно це інформція про картинки, лайки, скачування ітд)
    // перевіряємо чи прийшла відповідь чи сталась помилка (може статись умовно, якщо сервер не прцює, я ввела невірний ключ ітд)
    // if (!response.ok) - якщо відповідь НЕ окей, то зроби помилку
    // throw new Error(response.status) - прокинути (примусово відобарзити) помилку в консолі (її статус)
    if (!response.ok) {
      throw new Error(response.status);
    }
    return response.json(); // переводимо з JSON формату в масив або об'єкт або рядок в залежності від того з чим працюємо, тобо що прийде нам у відповідь
  });
}
